import pandas as pd

introduce={
    words=["성별",".혈액형","키","앞머리 유무"
    ,"안경착용 유무","운전면허 유무","자차 유무","자전거 유무"
    ,"코스트코 회원권 유무","소유 안경의 갯수","야구직관 유무","염색"
    ,"휴대폰 기종","편입","형제자매","아르바이트"]
    vectors=[[0], [3], [163],[1]
                ,[1],[1],[0],[1],
                [1],[3],[1],[0]
                ,[0],[1],[1],[1]
                ]
    labels=["woman(0)/man(1)","A(1)/B(2)/O(3)/AB(4)","cm","X(0)/O(1)"
            ,"X(0)/O(1)","X(0)/O(1)","X(0)/O(1)","X(0)/O(1)",
            "X(0)/O(1)",".","X(0)/O(1)","X(0)/O(1)"
            ,"아이폰(0)/갤럭시(1)","X(0)/O(1)","X(0)/O(1)","X(0)/O(1)"
    ]

    itr=pd.DataFrame({
        "label": words,
        "vector": vectors,
        "notation": labels
    })
    print(itr)
}